### 1.3 Task

Import library

In [2]:
import pandas as pd

Create a dataframe

In [3]:
data = pd.DataFrame({
    "Name": ['Jane Austen', 'George Orwell', 'William Shakespeare', 'Mark Twain'],
    "Nationality": ['British', 'British', 'British', 'American'],
    "Books_Written": [6, 9, 37, 25]})

In [4]:
data.head()

                  Name Nationality  Books_Written
0          Jane Austen     British              6
1        George Orwell     British              9
2  William Shakespeare     British             37
3           Mark Twain    American             25

Create a new column

In [6]:
data['Books_per_Year'] = data['Books_Written'].apply(lambda x: x / 10)

data.head()

                  Name Nationality  Books_Written  Books_per_Year
0          Jane Austen     British              6             0.6
1        George Orwell     British              9             0.9
2  William Shakespeare     British             37             3.7
3           Mark Twain    American             25             2.5

Create a flag column

In [7]:
data['Prolific_Author'] = data['Books_Written'].apply(lambda x: True if x > 10 else False)

In [8]:
data.head()

,Name,Nationality,Books_Written,Books_per_Year,Prolific_Author
0,Jane Austen,British,6,0.6,False
1,George Orwell,British,9,0.9,False
2,William Shakespeare,British,37,3.7,True
3,Mark Twain,American,25,2.5,True